bobmittmann/yard-ice/src/targets/stm32f/stm32f_defs.h
/* 
 * Copyright(C) 2012 Robinson Mittmann. All Rights Reserved.
 * 
 * This file is part of the YARD-ICE.
 *
 * This library is free software; you can redistribute it and/or
 * modify it under the terms of the GNU Lesser General Public
 * License as published by the Free Software Foundation; either
 * version 3.0 of the License, or (at your option) any later version.
 * 
 * This library is distributed in the hope that it will be useful,
 * but WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the GNU
 * Lesser General Public License for more details.
 * 
 * You can receive a copy of the GNU Lesser General Public License from 
 * http://www.gnu.org/
 */

/** 
 * @file stm32f_defs.c
 * @brief YARD-ICE
 * @author Robinson Mittmann <bobmittmann@gmail.com>
 */ 

#if defined(STM32F2X)

#define STM32F_BASE_FSMC    0xa0000000
#define STM32F_BASE_RNG     0x50060800
#define STM32F_BASE_HASH    0x50060400
#define STM32F_BASE_CRYP    0x50060000
#define STM32F_BASE_DCMI    0x50050000
#define STM32F_BASE_OTG_FS  0x50000000
#define STM32F_BASE_OTG_HS  0x40040000
#define STM32F_BASE_EMAC    0x40028000
#define STM32F_BASE_DMA2    0x40026400
#define STM32F_BASE_DMA1    0x40026000
#define STM32F_BASE_BKPSRAM 0x40024000
#define STM32F_BASE_FLASH   0x40023c00
#define STM32F_BASE_RCC     0x40023800
#define STM32F_BASE_CRC     0x40023000
#define STM32F_BASE_GPIOI   0x40022000
#define STM32F_BASE_GPIOH   0x40021c00
#define STM32F_BASE_GPIOG   0x40021800
#define STM32F_BASE_GPIOF   0x40021400
#define STM32F_BASE_GPIOE   0x40021000
#define STM32F_BASE_GPIOD   0x40020c00
#define STM32F_BASE_GPIOC   0x40020800
#define STM32F_BASE_GPIOB   0x40020400
#define STM32F_BASE_GPIOA   0x40020000
#define STM32F_BASE_TIM11   0x40014800
#define STM32F_BASE_TIM10   0x40014400
#define STM32F_BASE_TIM9    0x40014000
#define STM32F_BASE_EXTI    0x40013c00
#define STM32F_BASE_SYSCFG  0x40013800
#define STM32F_BASE_SPI1    0x40013000
#define STM32F_BASE_SDIO    0x40012c00
#define STM32F_BASE_USART6  0x40011400
#define STM32F_BASE_USART1  0x40011000
#define STM32F_BASE_TIM8    0x40010400
#define STM32F_BASE_TIM1    0x40010000
#define STM32F_BASE_DAC     0x40007400
#define STM32F_BASE_PWR     0x40007000
#define STM32F_BASE_CAN2    0x40006800
#define STM32F_BASE_CAN1    0x40006400
#define STM32F_BASE_I2C3    0x40005c00
#define STM32F_BASE_I2C2    0x40005800
#define STM32F_BASE_I2C1    0x40005400
#define STM32F_BASE_UART5   0x40005000
#define STM32F_BASE_UART4   0x40004c00
#define STM32F_BASE_USART3  0x40004800
#define STM32F_BASE_USART2  0x40004400
#define STM32F_BASE_SPI3    0x40003c00
#define STM32F_BASE_SPI2    0x40003800
#define STM32F_BASE_IWDG    0x40003000
#define STM32F_BASE_WWDG    0x40002c00
#define STM32F_BASE_RTC     0x40002800
#define STM32F_BASE_TIM14   0x40002000
#define STM32F_BASE_TIM13   0x40001c00
#define STM32F_BASE_TIM12   0x40001800
#define STM32F_BASE_TIM7    0x40001400
#define STM32F_BASE_TIM6    0x40001000
#define STM32F_BASE_TIM5    0x40000c00
#define STM32F_BASE_TIM4    0x40000800
#define STM32F_BASE_TIM3    0x40000400
#define STM32F_BASE_TIM2    0x40000000

#elif defined(STM32F10X)

#define STM32F_BASE_FSMC    0xa0000000
#define STM32F_BASE_OTG_FS  0x50000000
#define STM32F_BASE_EMAC    0x40028000
#define STM32F_BASE_CRC     0x40023000
#define STM32F_BASE_FLASH   0x40022000
#define STM32F_BASE_RCC     0x40021000
#define STM32F_BASE_DMA2    0x40020400
#define STM32F_BASE_DMA1    0x40020000
#define STM32F_BASE_SDIO    0x40018000
#define STM32F_BASE_TIM11   0x40015400
#define STM32F_BASE_TIM10   0x40015000
#define STM32F_BASE_TIM9    0x40014c00
#define STM32F_BASE_ADC3    0x40013c00
#define STM32F_BASE_USART1  0x40013800
#define STM32F_BASE_TIM8    0x40013400
#define STM32F_BASE_SPI1    0x40013000
#define STM32F_BASE_TIM1    0x40012c00
#define STM32F_BASE_ADC2    0x40012800
#define STM32F_BASE_ADC1    0x40012400
#define STM32F_BASE_GPIOG   0x40012000
#define STM32F_BASE_GPIOF   0x40011c00
#define STM32F_BASE_GPIOE   0x40011800
#define STM32F_BASE_GPIOD   0x40011400
#define STM32F_BASE_GPIOC   0x40011000
#define STM32F_BASE_GPIOB   0x40010c00
#define STM32F_BASE_GPIOA   0x40010800
#define STM32F_BASE_EXTI    0x40010400
#define STM32F_BASE_AFIO    0x40010000
#define STM32F_BASE_DAC     0x40007800
#define STM32F_BASE_PWR     0x40007000
#define STM32F_BASE_BKP     0x40006c00
#define STM32F_BASE_CAN2    0x40006800
#define STM32F_BASE_CAN1    0x40006400
#define STM32F_BASE_I2C2    0x40005800
#define STM32F_BASE_I2C1    0x40005400
#define STM32F_BASE_UART5   0x40005000
#define STM32F_BASE_UART4   0x40004c00
#define STM32F_BASE_USART3  0x40004800
#define STM32F_BASE_USART2  0x40004400
#define STM32F_BASE_SPI3    0x40003c00
#define STM32F_BASE_SPI2    0x40003800
#define STM32F_BASE_IWDG    0x40003000
#define STM32F_BASE_WWDG    0x40002c00
#define STM32F_BASE_RTC     0x40002800
#define STM32F_BASE_TIM14   0x40002000
#define STM32F_BASE_TIM13   0x40001c00
#define STM32F_BASE_TIM12   0x40001800
#define STM32F_BASE_TIM7    0x40001400
#define STM32F_BASE_TIM6    0x40001000
#define STM32F_BASE_TIM5    0x40000c00
#define STM32F_BASE_TIM4    0x40000800
#define STM32F_BASE_TIM3    0x40000400
#define STM32F_BASE_TIM2    0x40000000

#else 
#error "STM32 family undefined or invalid!"
#endif 


/*-------------------------------------------------------------------------
  Power Control (PWR)
  -------------------------------------------------------------------------*/

/* PWR power control register */
#define PWR_CR 0x00 

#define FPDS (1 << 9)
/* Flash power down in Stop mode. When set, the Flash memory enters power 
   down mode when the device enters Stop mode. This allows to achieve a lower 
   consumption in stop mode but a longer restart time.
0: Flash memory not in power down when the device is in Stop mode
1: Flash memory in power down when the device is in Stop mode */

#define DBP (1 << 8)
/* Disable backup domain write protection. In reset state, the RCC_BDCR 
   register, the RTC registers (including the backup registers), and 
   the BRE bit of the PWR_CSR register, are protected against parasitic 
   write access. This bit must be set to enable write access to these registers.
0: Access to RTC and RTC Backup registers and backup SRAM disabled
1: Access to RTC and RTC Backup registers and backup SRAM enabled */

#define PLS (0x7 << 5)
#define PLS_2_0V (0x0 << 5)
#define PLS_2_1V (0x1 << 5)
#define PLS_2_3V (0x2 << 5)
#define PLS_2_5V (0x3 << 5)
#define PLS_2_6V (0x4 << 5)
#define PLS_2_7V (0x5 << 5)
#define PLS_2_8V (0x6 << 5)
#define PLS_2_9V (0x7 << 5)
/* PVD level selection. These bits are written by software to select the voltage threshold detected by the Power
Voltage Detector
000: 2.0 V
001: 2.1 V
010: 2.3 V
011: 2.5 V
100: 2.6 V
101: 2.7 V
110: 2.8 V
111: 2.9 V
Note: Refer to the electrical characteristics of the datasheet for more details. */

#define PVDE (1 << 4)
/* Power voltage detector enable
This bit is set and cleared by software.
0: PVD disabled
1: PVD enabled */

#define CSBF (1 << 3)
/* Clear standby flag
This bit is always read as 0.
0: No effect
1: Clear the SBF Standby Flag (write). */

