bobmittmann/yard-ice/src/targets/stm32f/stm32f_defs.h
#define CWUF (1 << 2)
/* Clear wakeup flag
This bit is always read as 0.
0: No effect
1: Clear the WUF Wakeup Flag after 2 System clock cycles */

#define PDDS (1 << 1)
/* Power down deepsleep. This bit is set and cleared by software. 
   It works together with the LPDS bit. 
0: Enter Stop mode when the CPU enters deepsleep. 
	The regulator status depends on the LPDS bit.
1: Enter Standby mode when the CPU enters deepsleep. */

#define LPDS (1 << 0)
/* Low-power deep sleep
This bit is set and cleared by software. It works together with the PDDS bit.
0: Voltage regulator on during Stop mode
1: Voltage regulator in low-power mode during Stop mode */


/* PWR power control/status register */
#define PWR_CSR 0x04

#define BRE (1 << 9)
/* Backup regulator enable
When set, the Backup regulator (used to maintain backup SRAM content in 
Standby and VBAT modes) is enabled. If BRE is reset, the backup regulator is 
switched off. The backup SRAM can still be used but its content will be 
lost in the Standby and VBAT modes. Once set, the application must wait 
that the Backup Regulator Ready flag (BRR) is set to indicate that the
data written into the RAM will be maintained in the Standby and VBAT modes.
0: Backup regulator disabled
1: Backup regulator enabled
Note: This bit is not reset when the device wakes up from Standby mode, 
by a system reset, or by a power reset. */

#define EWUP (1 << 8)
/* Enable WKUP pin
This bit is set and cleared by software.
0: WKUP pin is used for general purpose I/O. An event on the WKUP 
pin does not wakeup the device from Standby mode.
1: WKUP pin is used for wakeup from Standby mode and forced in input pull 
down configuration (rising edge on WKUP pin wakes-up the system from 
Standby mode).
Note: This bit is reset by a system reset. */

#define BRR (1 << 3)
/* Backup regulator ready
Set by hardware to indicate that the Backup Regulator is ready.
0: Backup Regulator not ready
1: Backup Regulator ready
Note: This bit is not reset when the device wakes up from Standby 
mode or by a system reset or power reset. */

#define PVDO (1 << 2)
/* PVD output
This bit is set and cleared by hardware. It is valid only if PVD is enabled by the PVDE bit.
0: VDD/VDDA is higher than the PVD threshold selected with the PLS[2:0] bits.
1: VDD/VDDA is lower than the PVD threshold selected with the PLS[2:0] bits.
Note: The PVD is stopped by Standby mode. For this reason, this bit is equal to 0 after
Standby or reset until the PVDE bit is set. */

#define SBF (1 << 1)
/* Standby flag
This bit is set by hardware and cleared only by a 
POR/PDR (power-on reset/power-down reset)
or by setting the CSBF bit in the PWR power control register (PWR_CR)
0: Device has not been in Standby mode
1: Device has been in Standby mode */

#define WUF (1 << 0)
/* Wakeup flag
This bit is set by hardware and cleared only by a POR/PDR (power-on 
reset/power-down reset) or by setting the CWUF bit in the PWR power 
control register (PWR_CR)
0: No wakeup event occurred
1: A wakeup event was received from the WKUP pin or from the 
RTC alarm (Alarm A or Alarm B), RTC Tamper event, RTC TimeStamp event or 
RTC Wakeup).
Note: An additional wakeup event is detected if the WKUP pin is enabled 
(by setting the EWUP bit) when the WKUP pin level is already high. */

/*-------------------------------------------------------------------------
  System configuration controller
  -------------------------------------------------------------------------*/

/* Compensation cell control register */
#define SYSCFG_CMPCR 0x20

#define READY (1 << 8)
/* Compensation cell ready flag
0: I/O compensation cell not ready
1: O compensation cell ready*/

#define CMP_PD (1 << 0)
/* Compensation cell power-down
0: I/O compensation cell power-down mode
1: I/O compensation cell enabled */


/*-------------------------------------------------------------------------
  RCC
  -------------------------------------------------------------------------*/

/* ------------------------------------------------------------------------- */
/* RCC clock control register */ 
#define RCC_CR 0x00


/**/
#define PLLI2SRDY (1 << 27)
/* PLLI2S clock ready flag
Set by hardware to indicate that the PLLI2S is locked.
0: PLLI2S unlocked
1: PLLI2S locked*/
#define PLLI2SON (1 << 26)
/* PLLI2S enable
Set and cleared by software to enable PLLI2S.
Cleared by hardware when entering Stop or Standby mode.
0: PLLI2S OFF
1: PLLI2S ON*/
#define PLLRDY (1 << 25)
/* Main PLL (PLL) clock ready flag
Set by hardware to indicate that PLL is locked.
0: PLL unlocked
1: PLL locked*/
#define PLLON (1 << 24)
/* Main PLL (PLL) enable
Set and cleared by software to enable PLL.
Cleared by hardware when entering Stop or Standby mode. This bit cannot be reset if PLL
clock is used as the system clock.
0: PLL OFF
1: PLL ON
*/
#define CSSON (1 << 19)
/* Clock security system enable
Set and cleared by software to enable the clock security system. When CSSON is set, the
clock detector is enabled by hardware when the HSE oscillator is ready, and disabled by
hardware if an oscillator failure is detected.
0: Clock security system OFF (Clock detector OFF)
	1: Clock security system ON (Clock detector ON if HSE oscillator is stable, OFF if not)*/
#define HSEBYP (1 << 18)
/* HSE clock bypass
Set and cleared by software to bypass the oscillator with an external clock. The external
clock must be enabled with the HSEON bit, to be used by the device.
The HSEBYP bit can be written only if the HSE oscillator is disabled.
0: HSE oscillator not bypassed
1: HSE oscillator bypassed with an external clock*/
#define HSERDY (1 << 17)
/* HSE clock ready flag
Set by hardware to indicate that the HSE oscillator is stable. After the HSION bit is cleared,
HSERDY goes low after 6 HSE oscillator clock cycles.
0: HSE oscillator not ready
1: HSE oscillator ready*/
#define HSEON (1 << 16)
/* HSE clock enable
Set and cleared by software.
Cleared by hardware to stop the HSE oscillator when entering Stop or Standby mode. This
bit cannot be reset if the HSE oscillator is used directly or indirectly as the system clock.
0: HSE oscillator OFF
1: HSE oscillator ON*/

#define HSICAL (1 << 8)
/* Internal high-speed clock calibration
These bits are initialized automatically at startup.*/

#define HSITRIM (1 << 3)
/* Internal high-speed clock trimming
   These bits provide an additional user-programmable trimming value that is 
   added to the HSICAL[7:0] bits. It can be programmed to adjust to 
   variations in voltage and temperature that influence the frequency of 
   the internal HSI RC. */

