bobmittmann/yard-ice/src/targets/stm32f/stm32f_defs.h
/* Bit 2 Reserved, always read as 0.*/

#define HSIRDY (1 << 1)
/* Internal high-speed clock ready flag
Set by hardware to indicate that the HSI oscillator is stable. After the HSION bit is cleared,
HSIRDY goes low after 6 HSI clock cycles.
0: HSI oscillator not ready
1: HSI oscillator ready*/
#define HSION (1 << 0)
/* Internal high-speed clock enable
Set and cleared by software.
Set by hardware to force the HSI oscillator ON when leaving the Stop or Standby mode or in
case of a failure of the HSE oscillator used directly or indirectly as the system clock. This bit
cannot be cleared if the HSI is used directly or indirectly as the system clock.
0: HSI oscillator OFF
1: HSI oscillator ON
*/

#if defined(STM32F2X)

/* ------------------------------------------------------------------------- */
/* RCC PLL configuration register */
#define RCC_PLLCFGR 0x04

#define PLLQ_MASK (0xf << 24)
#define PLLQ(Q) (((Q) & 0xf) << 24)
/* Main PLL (PLL) division factor for USB OTG FS, SDIO and random number generator clocks Set and cleared by software to control the frequency of USB OTG FS clock, the random number generator clock and the SDIO clock. These bits should be written only if PLL is disabled.
Caution: The USB OTG FS requires a 48 MHz clock to work correctly. The SDIO and the random number generator need a frequency lower than or equal to 48 MHz to work correctly.
USB OTG FS clock frequency = VCO frequency / PLLQ with 4 <= PLLQ <= 15
0000: PLLQ = 0, wrong configuration
...
0011: PLLQ = 3, wrong configuration
0100: PLLQ = 4
0101: PLLQ = 5
...
1111: PLLQ = 15
Bit 23 Reserved, always read as 0.*/

#define PLLSRC (1 << 22)
#define PLLSRC_HSI (0 << 22)
#define PLLSRC_HSE (1 << 22)
/* Main PLL(PLL) and audio PLL (PLLI2S) entry clock source Set and cleared by software to select PLL and PLLI2S clock source. This bit can be written only when PLL and PLLI2S are disabled.
0: HSI clock selected as PLL and PLLI2S clock entry
1: HSE oscillator clock selected as PLL and PLLI2S clock entr*/

#define PLLP_MASK (0x3 << 16)
#define PLLP(P) (((((P) >> 1) - 1)  & 0x3) << 16)
#define PLLP_2 (0x0 << 16)
#define PLLP_4 (0x1 << 16)
#define PLLP_6 (0x2 << 16)
#define PLLP_8 (0x3 << 16)
/* Main PLL (PLL) division factor for main system clock Set and cleared by software to control the frequency of the general PLL output clock. These bits can be written only if PLL is disabled.
Caution: The software has to set these bits correctly not to exceed 120 MHz on this domain.
PLL output clock frequency = VCO frequency / PLLP with PLLP = 2, 4, 6, or 8
00: PLLP = 2
01: PLLP = 4
10: PLLP = 6
11: PLLP = 8 */

#define PLLN_MASK (0xff << 6)
#define PLLN(N) (((N) & 0xff) << 6)
/* Main PLL (PLL) multiplication factor for VCO Set and cleared by software to control the multiplication factor of the VCO. These bits can be written only when PLL is disabled. Only half-word and word accesses are allowed to write these bits.
Caution: The software has to set these bits correctly to ensure that the VCO output
frequency is between 192 and 432 MHz.
VCO output frequency = VCO input frequency × PLLN with 192 ≤ PLLN ≤ 432
000000000: PLLN = 0, wrong configuration
000000001: PLLN = 1, wrong configuration
...
011000000: PLLN = 192
011000001: PLLN = 193
011000010: PLLN = 194
...
110110000: PLLN = 432
110110000: PLLN = 433, wrong configuration
...
111111111: PLLN = 511, wrong configuration*/

#define PLLM_MASK (0x1f << 0)
#define PLLM(M) (((M) & 0x1f) << 0)
/* Division factor for the main PLL (PLL) and audio PLL (PLLI2S) input clock
Set and cleared by software to divide the PLL and PLLI2S input clock before the VCO. These bits can be written only when the PLL and PLLI2S are disabled. Caution: The software has to set these bits correctly to ensure that the VCO input frequency ranges from 1 to 2 MHz. It is recommended to select a frequency of 2 MHz to limit PLL jitter.
VCO input frequency = PLL input clock frequency / PLLM with 2 ≤ PLLM ≤ 63
000000: PLLM = 0, wrong configuration
000001: PLLM = 1, wrong configuration
000010: PLLM = 2
000011: PLLM = 3
000100: PLLM = 4
...
111110: PLLM = 62
111111: PLLM = 63 */

#endif /*STM32F2X */


/* ------------------------------------------------------------------------- */
/* RCC clock configuration register */

#if defined(STM32F10X)

#define RCC_CFGR 0x04
/* STM32F10x RCC clock configuration register */

#define MCO_SYSCLK (0x4 << 24)
#define MCO_HSI    (0x5 << 24)
#define MCO_HSE    (0x6 << 24)
#define MCO_PLL    (0x7 << 24)

#define USBPRE     (1 << 22)

#define PLLMUL_MASK   (0x0f << 18)
#define PLLMUL(M) ((((M) - 2) & 0x0f) << 18)

#define PLLXTPRE      (1 << 17)

#define PLLSRC     (1 << 16)
#define PLLSRC_HSI (0 << 16)
#define PLLSRC_HSE (1 << 16)

#define ADCPRE   (0x3 << 14)
#define ADCPRE_2 (0x0 << 14)
#define ADCPRE_4 (0x1 << 14)
#define ADCPRE_6 (0x2 << 14)
#define ADCPRE_8 (0x3 << 14)

#define PPRE2    (0x7 << 11)
#define PPRE2_1  (0x0 << 11)
#define PPRE2_2  (0x4 << 11)
#define PPRE2_4  (0x5 << 11)
#define PPRE2_8  (0x6 << 11)
#define PPRE2_16 (0x7 << 11)

#define PPRE1    (0x7 << 8)
#define PPRE1_1  (0x0 << 8)
#define PPRE1_2  (0x4 << 8)
#define PPRE1_4  (0x5 << 8)
#define PPRE1_8  (0x6 << 8)
#define PPRE1_16 (0x7 << 8)

#endif /*STM32F10X */


#if defined(STM32F2X)

#define RCC_CFGR 0x08

/**/
#define MCO2 (0x3 << 30)
#define MCO2_SYSCLK (0x0 << 30)
#define MCO2_PLLI2S (0x1 << 30)
#define MCO2_HSE    (0x2 << 30)
#define MCO2_PLL    (0x3 << 30)
/* Microcontroller clock output 2
   Set and cleared by software. Clock source selection may generate glitches on MCO2. It is highly recommended to configure these bits only after reset before enabling the external oscillators and the PLLs.
   00: System clock (SYSCLK) selected
   01: PLLI2S clock selected
   10: HSE oscillator clock selected
   11: PLL clock selected*/

#define MCO2PRE (0x7 << 27)
#define MCO2PRE_1 (0x0 << 27)
#define MCO2PRE_2 (0x4 << 27)
#define MCO2PRE_3 (0x5 << 27)
#define MCO2PRE_4 (0x6 << 27) #define MCO2PRE_5 (0x7 << 27)  
/* MCO2 prescaler
   Set and cleared by software to configure the prescaler of the MCO2. Modification of this prescaler may generate glitches on MCO2. It is highly recommended to change this prescaler only after reset before enabling the external oscillators and the PLLs.
   0xx: no division
   100: division by 2
   101: division by 3
   110: division by 4
   111: division by 5 */

#define MCO1PRE (0x7 << 24)
#define MCO1PRE_1 (0x0 << 24)
#define MCO1PRE_2 (0x4 << 24)
#define MCO1PRE_3 (0x5 << 24)
#define MCO1PRE_4 (0x6 << 24)
#define MCO1PRE_5 (0x7 << 24)
/* MCO1 prescaler
   Set and cleared by software to configure the prescaler of the MCO1. Modification of this prescaler may generate glitches on MCO1. It is highly recommended to change this prescaler only after reset before enabling the external oscillators and the PLL.
   0xx: no division
   100: division by 2
   101: division by 3
   110: division by 4
   111: division by 5*/

#define I2SSRC (1 << 23)
/* I2S clock selection
   Set and cleared by software. This bit allows to select the I2S clock source between the PLLI2S clock and the external clock. It is highly recommended to change this bit only after reset and before enabling the I2S module.
   0: PLLI2S clock used as I2S clock source
   1: External clock mapped on the I2S_CKIN pin used as I2S clock source */

