bobmittmann/yard-ice/src/targets/stm32f/stm32f_defs.h
#define MCO1 (0x3 << 21)
#define MCO1_HSI (0x0 << 21)
#define MCO1_LSE (0x1 << 21)
#define MCO1_HSE (0x2 << 21)
#define MCO1_PLL (0x3 << 21)
/* Microcontroller clock output 1
Set and cleared by software. Clock source selection may generate glitches on MCO1. It is highly recommended to configure these bits only after reset before enabling the external oscillators and PLL.
00: HSI clock selected
01: LSE oscillator selected
10: HSE oscillator clock selected
11: PLL clock selected */

#define RTCPRE (0x1f << 16)
/* HSE division factor for RTC clock
Set and cleared by software to divide the HSE clock input clock to generate a 1 MHz clock for RTC.
Caution: The software has to set these bits correctly to ensure that the clock supplied to the
RTC is 1 MHz. These bits must be configured if needed before selecting the RTC
clock source.
00000: no clock
00001: no clock
00010: HSE/2
00011: HSE/3
00100: HSE/4
...
11110: HSE/30
11111: HSE/31 */

#define PPRE2 (0x7 << 13)
#define PPRE2_1 (0x0 << 13)
#define PPRE2_2 (0x4 << 13)
#define PPRE2_4 (0x5 << 13)
#define PPRE2_8 (0x6 << 13)
#define PPRE2_16 (0x7 << 13)
/* APB high-speed prescaler (APB2)
   Set and cleared by software to control APB high-speed clock division factor.
   Caution: The software has to set these bits correctly not to exceed 60 MHz 
   on this domain.
   The clocks are divided with the new prescaler factor from 1 to 16 AHB 
   cycles after PPRE2 write.
   0xx: AHB clock not divided
   100: AHB clock divided by 2
   101: AHB clock divided by 4
   110: AHB clock divided by 8
   111: AHB clock divided by 16 */

#define PPRE1 (0x7 << 10)
#define PPRE1_1 (0x0 << 10)
#define PPRE1_2 (0x4 << 10)
#define PPRE1_4 (0x5 << 10)
#define PPRE1_8 (0x6 << 10)
#define PPRE1_16 (0x7 << 10)
/* APB Low speed prescaler (APB1)
   Set and cleared by software to control APB low-speed clock division factor.
   Caution: The software has to set these bits correctly not to exceed 
   30 MHz on this domain.
   The clocks are divided with the new prescaler factor 
   from 1 to 16 AHB cycles after PPRE1 write.
   0xx: AHB clock not divided
   100: AHB clock divided by 2
   101: AHB clock divided by 4
   110: AHB clock divided by 8
   111: AHB clock divided by 16 */

#endif /*STM32F2X */

#define HPRE (0xf << 4)
#define HPRE_1 (0x0 << 4)
#define HPRE_2 (0x8 << 4)
#define HPRE_4 (0x9 << 4)
#define HPRE_8 (0xa << 4)
#define HPRE_16 (0xb << 4)
#define HPRE_64 (0xc << 4)
#define HPRE_128 (0xd << 4)
#define HPRE_256 (0xe << 4)
#define HPRE_512 (0xf << 4)
/* AHB prescaler
   Set and cleared by software to control AHB clock division factor.
   Caution: The clocks are divided with the new prescaler factor from 
   1 to 16 AHB cycles after HPRE write.
   Caution: The AHB clock frequency must be at least 25 MHz when the Ethernet 
   is used.
   0xxx: system clock not divided
   1000: system clock divided by 2
   1001: system clock divided by 4
   1010: system clock divided by 8
   1011: system clock divided by 16
   1100: system clock divided by 64
   1101: system clock divided by 128
   1110: system clock divided by 256
   1111: system clock divided by 512 */

#define SWS (0x3 << 2)
#define SWS_HSI (0x0 << 2)
#define SWS_HSE (0x1 << 2)
#define SWS_PLL (0x2 << 2)
/* System clock switch status. Set and cleared by hardware to indicate which 
   clock source is used as the system clock.
00: HSI oscillator used as the system clock
01: HSE oscillator used as the system clock
10: PLL used as the system clock
11: not applicable */

#define SW (0x3 << 0)
#define SW_HSI (0x0 << 0)
#define SW_HSE (0x1 << 0)
#define SW_PLL (0x2 << 0)
/* System clock switch
Set and cleared by software to select the system clock source.
Set by hardware to force the HSI selection when leaving the Stop or Standby mode or in case of failure of the HSE oscillator used directly or indirectly as the system clock.
00: HSI oscillator selected as system clock
01: HSE oscillator selected as system clock
10: PLL selected as system clock
11: not allowed
*/

/* ------------------------------------------------------------------------- */
#define STM32F10_RCC_CIR      (STM32F10_BASE_RCC + 0x08)

/* ------------------------------------------------------------------------- */
/* RCC AHB1 peripheral clock register */
#define RCC_AHB1ENR 0x30

#define OTGHSULPIEN (1 << 30)
/* USB OTG HSULPI clock enable
Set and cleared by software.
0: USB OTG HS ULPI clock disabled
1: USB OTG HS ULPI clock enabled*/
#define OTGHSEN (1 << 29)
/* USB OTG HS clock enable
Set and cleared by software.
0: USB OTG HS clock disabled
1: USB OTG HS clock enabled*/
#define ETHMACPTPEN (1 << 28)
/* Ethernet PTP clock enable
Set and cleared by software.
0: Ethernet PTP clock disabled
1: Ethernet PTP clock enabled*/
#define ETHMACRXEN (1 << 27)
/* Ethernet Reception clock enable
Set and cleared by software.
0: Ethernet Reception clock disabled
1: Ethernet Reception clock enabled*/
#define ETHMACTXEN (1 << 26)
/* Ethernet Transmission clock enable
Set and cleared by software.
0: Ethernet Transmission clock disabled
1: Ethernet Transmission clock enabled*/
#define ETHMACEN (1 << 25)
/* Ethernet MAC clock enable
Set and cleared by software.
0: Ethernet MAC clock disabled
1: Ethernet MAC clock enabled
Bits 24:23
Reserved, always read as 0.*/
#define DMA2EN (1 << 22)
/* DMA2 clock enable
Set and cleared by software.
0: DMA2 clock disabled
1: DMA2 clock enabled*/
#define DMA1EN (1 << 21)
/* DMA1 clock enable
Set and cleared by software.
0: DMA1 clock disabled
1: DMA1 clock enabled
Bits 20:19 Reserved, always read as 0.*/
#define BKPSRAMEN (1 << 18)
/* Backup SRAM interface clock enable
Set and cleared by software.
0: Backup SRAM interface clock disabled
1: Backup SRAM interface clock enabled
Bits 17:13 Reserved, always read as 0.*/
#define CRCEN (1 << 12)
/* CRC clock enable
Set and cleared by software.
0: CRC clock disabled
1: CRC clock enabled
Bits 11:9 Reserved, always read as 0.*/
#define GPIOIEN (1 << 8)
/* IO port I clock enable
Set and cleared by software.
0: IO port I clock disabled
1: IO port I clock enabled*/
#define GPIOHEN (1 << 7)
/* IO port H clock enable
Set and cleared by software.
0: IO port H clock disabled
1: IO port H clock enabled*/
#define GPIOGEN (1 << 6)
/* IO port G clock enable
Set and cleared by software.
0: IO port G clock disabled
1: IO port G clock enabled*/
#define GPIOFEN (1 << 5)
/* IO port F clock enable
Set and cleared by software.
0: IO port F clock disabled
1: IO port F clock enabled*/
#define GPIOEEN (1 << 4)
/* IO port E clock enable
Set and cleared by software.
0: IO port E clock disabled
1: IO port E clock enabled*/
#define GPIODEN (1 << 3)
/* IO port D clock enable
Set and cleared by software.
0: IO port D clock disabled
1: IO port D clock enabled*/
#define GPIOCEN (1 << 2)
/* IO port C clock enable
Set and cleared by software.
0: IO port C clock disabled
1: IO port C clock enabled*/
#define GPIOBEN (1 << 1)
/* IO port B clock enable
Set and cleared by software.
0: IO port B clock disabled
1: IO port B clock enabled*/
#define GPIOAEN (1 << 0)
/* IO port A clock enable
Set and cleared by software.
0: IO port A clock disabled
1: IO port A clock enabled */

/* RCC Backup domain control register */
#define RCC_BDCR 0x70

#define BDRST (1 << 16)
/* Backup domain software reset
Set and cleared by software.
0: Reset not activated
1: Resets the entire Backup domain
Note: The BKPSRAM is not affected by this reset, the only way of resetting the BKPSRAM is
through the Flash interface when a protection level change from level 1 to level 0 is
requested. */

#define RTCEN (1 << 15)
/* RTC clock enable
Set and cleared by software.
0: RTC clock disabled
1: RTC clock enabled
Bits 14:10
Reserved, always read as 0. */

