bobmittmann/yard-ice/src/targets/stm32f/stm32f_defs.h
#define RTCSEL (1 << 8)
#define RTCSEL_NONE (0 << 8)
#define RTCSEL_LSE (1 << 8)
#define RTCSEL_LSI (2 << 8)
#define RTCSEL_HSE (3 << 8)
/* RTC clock source selection
Set by software to select the clock source for the RTC. Once the RTC clock source has been
selected, it cannot be changed anymore unless the Backup domain is reset. The BDRST bit
can be used to reset them.
00: No clock
01: LSE oscillator clock used as the RTC clock
10: LSI oscillator clock used as the RTC clock
11: HSE oscillator clock divided by a programmable prescaler (selection through the RTCPRE[4:0] bits in the RCC clock configuration register (RCC_CFGR)) used as the RTC clock */

#define LSEBYP (1 << 2)
/* External low-speed oscillator bypass
Set and cleared by software to bypass oscillator in debug mode. This bit can be written only
when the LSE clock is disabled.
0: LSE oscillator not bypassed
1: LSE oscillator bypassed */

#define LSERDY (1 << 1)
/* External low-speed oscillator ready. Set and cleared by hardware to 
   indicate when the external 32 kHz oscillator is stable. 
   After the LSEON bit is cleared, LSERDY goes low after 6 external 
   low-speed oscillator clock cycles.
0: LSE clock not ready
1: LSE clock ready */

#define LSEON (1 << 0)
/* External low-speed oscillator enable
Set and cleared by software.
0: LSE clock OFF
1: LSE clock ON */

/* RCC clock control & status register */
#define RCC_CSR 0x74

#define LPWRRSTF (1 << 31)
/* Low-power reset flag
Set by hardware when a Low-power management reset occurs.
Cleared by writing to the RMVF bit.
0: No Low-power management reset occurred
1: Low-power management reset occurred
For further information on Low-power management reset, 
refer to Low-power management reset. */

#define WWDGRSTF (1 << 30)
/* Window watchdog reset flag
Set by hardware when a window watchdog reset occurs.
Cleared by writing to the RMVF bit.
0: No window watchdog reset occurred
1: Window watchdog reset occurred */

#define IWDGRSTF (1 << 29)
/* Independent watchdog reset flag
Set by hardware when an independent watchdog reset from VDD domain occurs.
Cleared by writing to the RMVF bit.
0: No watchdog reset occurred
1: Watchdog reset occurred */

#define SFTRSTF (1 << 28)
/* Software reset flag
Set by hardware when a software reset occurs.
Cleared by writing to the RMVF bit.
0: No software reset occurred
1: Software reset occurred */

#define PORRSTF (1 << 27)
/* POR/PDR reset flag
Set by hardware when a POR/PDR reset occurs.
Cleared by writing to the RMVF bit.
0: No POR/PDR reset occurred
1: POR/PDR reset occurred */

#define PINRSTF (1 << 26)
/* PIN reset flag
Set by hardware when a reset from the NRST pin occurs.
Cleared by writing to the RMVF bit.
0: No reset from NRST pin occurred
1: Reset from NRST pin occurred */

#define BORRSTF (1 << 25)
/* BOR reset flag
Cleared by software by writing the RMVF bit.
Set by hardware when a POR/PDR or BOR reset occurs.
0: No POR/PDR or BOR reset occurred
1: POR/PDR or BOR reset occurred */

#define RMVF (1 << 24)
/* Remove reset flag
Set by software to clear the reset flags.
0: No effect
1: Clear the reset flags */

#define LSIRDY (1 << 1)
/* Internal low-speed oscillator ready
Set and cleared by hardware to indicate when the internal RC 
40 kHz oscillator is stable.
After the LSION bit is cleared, LSIRDY goes low after 3 LSI clock cycles.
0: LSI RC oscillator not ready
1: LSI RC oscillator ready */

#define LSION (1 << 0)
/* Internal low-speed oscillator enable
Set and cleared by software.
0: LSI RC oscillator OFF
1: LSI RC oscillator ON */

/* RCC APB1 peripheral clock enable register */
#define RCC_APB1ENR 0x40

#define DACEN (1 << 29)
/* DAC interface clock enable
Set and cleared by software.
0: DAC interface clock disabled
1: DAC interface clock enable */

#define PWREN (1 << 28)
/* Power interface clock enable
Set and cleared by software.
0: Power interface clock disabled
1: Power interface clock enable */

#define CAN2EN (1 << 26)
/* CAN 2 clock enable
Set and cleared by software.
0: CAN 2 clock disabled
1: CAN 2 clock enabled */

#define CAN1EN (1 << 25)
/* CAN 1 clock enable
Set and cleared by software.
0: CAN 1 clock disabled
1: CAN 1 clock enabled */

#define I2C3EN (1 << 23)
/* I2C3 clock enable
Set and cleared by software.
0: I2C3 clock disabled
1: I2C3 clock enabled */

#define I2C2EN (1 << 22)
/* I2C2 clock enable
Set and cleared by software.
0: I2C2 clock disabled
1: I2C2 clock enabled */

#define I2C1EN (1 << 21)
/* I2C1 clock enable
Set and cleared by software.
0: I2C1 clock disabled
1: I2C1 clock enabled */

#define UART5EN (1 << 20)
/* UART5 clock enable
Set and cleared by software.
0: UART5 clock disabled
1: UART5 clock enabled */

#define UART4EN (1 << 19)
/* UART4 clock enable
Set and cleared by software.
0: UART4 clock disabled
1: UART4 clock enabled */

#define USART3EN (1 << 18)
/* USART3 clock enable
Set and cleared by software.
0: USART3 clock disabled
1: USART3 clock enabled */

#define USART2EN (1 << 17)
/* USART 2 clock enable
Set and cleared by software.
0: USART2 clock disabled
1: USART2 clock enabled */

#define SPI3EN (1 << 15)
/* SPI3 clock enable
Set and cleared by software.
0: SPI3 clock disabled
1: SPI3 clock enabled */

#define SPI2EN (1 << 14)
/* SPI2 clock enable
Set and cleared by software.
0: SPI2 clock disabled
1: SPI2 clock enabled */

#define WWDGEN (1 << 11)
/* Window watchdog clock enable
Set and cleared by software.
0: Window watchdog clock disabled
1: Window watchdog clock enabled */

#define TIM14EN (1 << 8)
/* TIM14 clock enable
Set and cleared by software.
0: TIM14 clock disabled
1: TIM14 clock enabled */

#define TIM13EN (1 << 7)
/* TIM13 clock enable
Set and cleared by software.
0: TIM13 clock disabled
1: TIM13 clock enabled */

#define TIM12EN (1 << 6)
/* TIM12 clock enable
Set and cleared by software.
0: TIM12 clock disabled
1: TIM12 clock enabled */

#define TIM7EN (1 << 5)
/* TIM7 clock enable
Set and cleared by software.
0: TIM7 clock disabled
1: TIM7 clock enabled */

#define TIM6EN (1 << 4)
/* TIM6 clock enable
Set and cleared by software.
0: TIM6 clock disabled
1: TIM6 clock enabled */

#define TIM5EN (1 << 3)
/* TIM5 clock enable
Set and cleared by software.
0: TIM5 clock disabled
1: TIM5 clock enabled */

#define TIM4EN (1 << 2)
/* TIM4 clock enable
Set and cleared by software.
0: TIM4 clock disabled
1: TIM4 clock enabled */

#define TIM3EN (1 << 1)
/* TIM3 clock enable
Set and cleared by software.
0: TIM3 clock disabled
1: TIM3 clock enabled */

#define TIM2EN (1 << 0)
/* TIM2 clock enable
Set and cleared by software.
0: TIM2 clock disabled
1: TIM2 clock enabled */

/* RCC APB2 peripheral clock enable register */
#define RCC_APB2ENR 0x44

#define TIM11EN (1 << 18)
/* TIM11 clock enable
Set and cleared by software.
0: TIM11 clock disabled
1: TIM11 clock enabled */

#define TIM10EN (1 << 17)
/* TIM10 clock enable
Set and cleared by software.
0: TIM10 clock disabled
1: TIM10 clock enabled */

