bobmittmann/yard-ice/src/targets/stm32f/stm32f_defs.h
#define TIM9EN (1 << 16)
/* TIM9 clock enable
Set and cleared by software.
0: TIM9 clock disabled
1: TIM9 clock enabled */

#define SYSCFGEN (1 << 14)
/* System configuration controller clock enable
Set and cleared by software.
0: System configuration controller clock disabled
1: System configuration controller clock enabled */

#define SPI1EN (1 << 12)
/* SPI1 clock enable
Set and cleared by software.
0: SPI1 clock disabled
1: SPI1 clock enabled */

#define SDIOEN (1 << 11)
/* SDIO clock enable
Set and cleared by software.
0: SDIO module clock disabled
1: SDIO module clock enabled */

#define ADC3EN (1 << 10)
/* ADC3 clock enable
Set and cleared by software.
0: ADC3 clock disabled
1: ADC3 clock disabled
 */

#define ADC2EN (1 << 9)
/* ADC2 clock enable
Set and cleared by software.
0: ADC2 clock disabled
1: ADC2 clock disabled */

#define ADC1EN (1 << 8)
/* ADC1 clock enable
Set and cleared by software.
0: ADC1 clock disabled
1: ADC1 clock disabled
Bits 7:6
Reserved, always read as 0. */

#define USART6EN (1 << 5)
/* USART6 clock enable
Set and cleared by software.
0: USART6 clock disabled
1: USART6 clock enabled */

#define USART1EN (1 << 4)
/* USART1 clock enable
Set and cleared by software.
0: USART1 clock disabled
1: USART1 clock enabled
Bits 3:2
Reserved, always read as 0. */

#define TIM8EN (1 << 1)
/* TIM8 clock enable
Set and cleared by software.
0: TIM8 clock disabled
1: TIM8 clock enabled */

#define TIM1EN (1 << 0)
/* TIM1 clock enable
Set and cleared by software.
0: TIM1 clock disabled
1: TIM1 clock enabled */


/*-------------------------------------------------------------------------
  GPIO
  -------------------------------------------------------------------------*/

/* GPIO port mode register */
#define GPIO_MODER 0x00
#define MODE_INPUT(P) (0 << (2 * (P)))
#define MODE_OUTPUT(P) (1 << (2 * (P)))
#define MODE_ALT_FUNC(P) (2 << (2 * (P)))
#define MODE_ANALOG(P) (3 << (2 * (P)))

/* GPIO port output type register */
#define GPIO_OTYPER 0x04
#define PUSH_PULL(P) (0 << (P))
#define OPEN_DRAIN(P) (1 << (P))

/* GPIO port output speed register */
#define GPIO_OSPEEDR 0x08
#define OSPEEDR_LOW(P) (0 << (2 * (P)))
#define OSPEEDR_MED(P) (1 << (2 * (P)))
#define OSPEEDR_FAST(P) (2 << (2 * (P)))
#define OSPEEDR_HIGH(P) (3 << (2 * (P)))

/* GPIO alternate function low register */
#define GPIO_AFRL 0x20
#define AFRL(P, F) ((F) << (16 * (P)))

/* GPIO alternate function high register */
#define GPIO_AFRH 0x24
#define AFRH(P, F) ((F) << (16 * ((P) - 8)))

#define AF0 0
#define AF1 1
#define AF2 2
#define AF3 3
#define AF4 4
#define AF5 5
#define AF6 6
#define AF7 7
#define AF8 8
#define AF9 9
#define AF10 10
#define AF11 11
#define AF12 12
#define AF13 13
#define AF14 14
#define AF15 15

/*-------------------------------------------------------------------------
  Flash Interface
  -------------------------------------------------------------------------*/

/* Flash access control register */
#define FLASH_ACR 0x00
/*	The Flash access control register is used to enable/disable 
	the acceleration features and control the Flash memory access 
	time according to CPU frequency. */

#if defined(STM32F2X)

#define DCRST (1 << 12)
/* Data cache reset
0: Data cache is not reset
1: Data cache is reset
This bit can be written only when the D cache is disabled.*/

#define ICRST (1 << 11)
/* Instruction cache reset
0: Instruction cache is not reset
1: Instruction cache is reset
This bit can be written only when the I cache is disabled.*/

#define DCEN (1 << 10)
/* Data cache enable
0: Data cache is disabled
1: Data cache is enabled*/

#define ICEN (1 << 9)
/* Instruction cache enable
0: Instruction cache is disabled
1: Instruction cache is enabled*/

#define PRFTEN (1 << 8)
/* Prefetch enable
0: Prefetch is disabled
1: Prefetch is enabled */

#endif /* STM32F2X */

#if defined(STM32F10X)

#define PRFTBS (1 << 5)
#define PRFTBE (1 << 4)
#define HLFCYA (1 << 3)

#endif /* STM32F10X */

#define LATENCY(WS) (((WS) & 0x7) << 0)
/* Latency. These bits represent the ratio of the CPU clock period to the Flash memory access time. 
000: Zero wait state
001: One wait state
010: Two wait states
011: Three wait states
100: Four wait states
101: Five wait states
110: Six wait states
111: Seven wait states */


/* ------------------------------------------------------------------------- */
/* Flash key register */
#define FLASH_KEYR 0x04
/* The Flash key register is used to allow access to the Flash control 
   register and so, to allow program and erase operations. */
#define FLASH_KEY1 0x45670123
#define FLASH_KEY2 0xcdef89ab

/* Flash option key register */
#define FLASH_OPTKEYR 0x08
/* The Flash option key register is used to allow program and erase 
   operations in the user configuration sector. */
#define OPTKEY1 0x08192a3b
#define OPTKEY2 0x4c5d6e7f



/* ------------------------------------------------------------------------- */
/* Flash status register */
#define FLASH_SR 0x0c
/* The Flash status register gives information on ongoing program and 
   erase operations. */

#if defined(STM32F2X)

#define BSY (1 << 16)
/* Busy. This bit indicates that a Flash memory operation is in progress. 
   It is set at the beginning of a Flash memory operation and cleared 
   when the operation finishes or an error occurs.
	0: no Flash memory operation ongoing
	1: Flash memory operation ongoing */

#define PGSERR (1 << 7)
/* Programming sequence error. Set by hardware when a write access to 
   the Flash memory is performed by the code while the control register 
   has not been correctly configured.
   Cleared by writing 1.*/

#define PGPERR (1 << 6)
/* Programming parallelism error. Set by hardware when the size of the 
   access (byte, half-word, word, double word) during the program 
   sequence does not correspond to the parallelism configuration 
   PSIZE (x8, x16, x32, x64).
   Cleared by writing 1.*/

#define PGAERR (1 << 5)
/* Programming alignment error. Set by hardware when the data to program 
   cannot be contained in the same 128-bit Flash memory row.
   Cleared by writing 1.*/

#define WRPERR (1 << 4)
/* Write protection error. Set by hardware when an address to be 
   erased/programmed belongs to a write-protected part of the Flash memory.
   Cleared by writing 1.*/

