bobmittmann/yard-ice/src/targets/stm32f/stm32f_defs.h
#define OPERR (1 << 1)
/* Operation error. Set by hardware when a flash operation 
   (programming / erase) request is detected and can not be run because 
   of parallelism, alignment, sequence or write protection error. This bit 
   is set only if error interrupts are enabled (ERRIE = 1).*/

#define EOP (1 << 0)
/* End of operation. Set by hardware when one or more Flash memory 
   operations (program/erase) has/have completed successfully. 
   It is set only if the end of operation interrupts are 
   enabled (EOPIE = 1).
   Cleared by writing a 1. */

#endif /* STM32F2X */

#if defined(STM32F10X)

#define EOP      (1 << 5)
#define WRPRTERR (1 << 4)
#define PGPERR   (1 << 2)
#define BSY      (1 << 0)

#endif /* STM32F10X */


/* ------------------------------------------------------------------------- */
/* Flash control register */
#define FLASH_CR 0x10
/* The Flash control register is used to configure and start 
   Flash memory operations. */

#if defined(STM32F2X)

#define LOCK (1 << 31)
/* Lock. Write to 1 only. When it is set, this bit indicates that the 
   FLASH_CR register is locked. It is cleared by hardware after detecting 
   the unlock sequence. In the event of an unsuccessful unlock operation, 
   this bit remains set until the next reset. */

#define ERRIE (1 << 25)
/* Error interrupt enable. This bit enables the interrupt generation when 
   the OPERR bit in the FLASH_SR register is set to 1.
0: Error interrupt generation disabled
1: Error interrupt generation enabled */

#define EOPIE (1 << 24)
/* End of operation interrupt enable. This bit enables the interrupt 
   generation when the EOP bit in the FLASH_SR register goes to 1.
0: Interrupt generation disabled
1: Interrupt generation enabled */

#define STRT (1 << 16)
/* Start. This bit triggers an erase operation when set. It is set only by 
   software and cleared when the BSY bit is cleared. */

#define PSIZE (0x3 << 8)
#define PSIZE_8 (0x0 << 8)
#define PSIZE_16 (0x1 << 8)
#define PSIZE_32 (0x2 << 8)
#define PSIZE_64 (0x3 << 8)
/* Program size. These bits select the program parallelism.
00 program x8
01 program x16
10 program x32
11 program x64 */

#define SNB(SECT) (((SECT) & 0xf) << 3)
/* Sector number. These bits select the sector to erase.
0000 sector 0
0001 sector 1
...
1011 sector 11
Others not allowed*/

#endif /* STM32F2X */

#if defined(STM32F10X)

#define EOPIE  (1 << 12)
#define ERRIE  (1 << 10)
#define OPTWRE (1 << 9)
#define LOCK   (1 << 7)
#define STRT   (1 << 6)
#define OPTER  (1 << 5)
#define OPTPG  (1 << 4)

#endif /* STM32F10X */

#define MER (1 << 2)
/* Mass Erase. Erase activated for all user sectors.*/

#define SER (1 << 1)
/* Sector Erase. Sector Erase activated.*/

#define PER (1 << 1)

#define PG (1 << 0)
/* Programming. Flash programming activated. */


#if defined(STM32F10X)

/* Flash address register */
#define FLASH_AR 0x14

#endif /* STM32F10X */

/* Flash option control register */
#define FLASH_OPTCR 0x14
/* The FLASH_OPTCR register is used to modify the user option bytes. */

#define NWRP (1 << 16)
/* Not write protect
These bits contain the value of the write-protection option bytes after reset. They can be
written to program a new write protect value into Flash memory.
0: Write protection active
1: Write protection not active */

#define RDP (1 << 15)
/* Read protect
These bits contain the value of the read-protection option level after reset. They can be
written to program a new read protection value into Flash memory.
0xAA: Level 0, read protection not active
0xCC: Level 2, chip read protection active
Others: Level 1, read protection of memories active */

#define USER (1 << 7)
/* User option bytes
These bits contain the value of the user option byte after reset. They can be written to
program a new user option byte value into Flash memory.
Bit 7: nRST_STDBY
Bit 6: nRST_STOP
Bit 5: WDG_SW
Note: When changing the WDG mode from hardware to software or from software to
hardware, a system reset is required to make the change effective.
Bit 4 Reserved, must be kept cleared. */

#define BOR_LEV (1 << 3)
/* BOR reset Level. These bits contain the supply level threshold that 
   activates/releases the reset. They can be written to program a new BOR 
   level. By default, BOR is off. When the supply voltage (VDD) drops below 
   the selected BOR level, a device reset is generated.
00: BOR Level 3 (VBOR3), reset threshold level for 2.70 to 3.60 V voltage range
01: BOR Level 2 (VBOR2), reset threshold level for 2.40 to 2.70 V voltage range
10: BOR Level 1 (VBOR1), reset threshold level for 2.10 to 2.40 V voltage range
11: BOR off (VBOR0), reset threshold level for 1.80 to 2.10 V voltage range
Note: For full details about BOR characteristics, refer to the "Electrical characteristics" section
in the device datasheet. */

#define OPTSTRT (1 << 1)
/* Option start. This bit triggers a user option operation when set. 
   It is set only by software and cleared when the BSY bit is cleared. */

#define OPTLOCK (1 << 0)
/* Option lock. Write to 1 only. When this bit is set, it indicates that 
   the FLASH_OPTCR register is locked. This bit is cleared by hardware 
   after detecting the unlock sequence. In the event of an unsuccessful 
   unlock operation, this bit remains set until the next reset. */

/*-------------------------------------------------------------------------
  RTC
  -------------------------------------------------------------------------*/

/* RTC time register */
#define RTC_TR 0x00
/* RTC date register */
#define RTC_DR 0x04
/* RTC control register */
#define RTC_CR 0x08
/* RTC initialization and status register */
#define RTC_ISR 0x0c
/* RTC prescaler register */
#define RTC_PRER 0x10
/* RTC wakeup timer register */
#define RTC_WUTR 0x14
/* RTC calibration register */
#define RTC_CALIBR 0x18
/* RTC alarm A register */
#define RTC_ALRMAR 0x1c
/* RTC alarm B register */
#define RTC_ALRMBR 0x20
/* RTC write protection register */
#define RTC_WPR 0x24
#define WPR_KEY1 0xca
#define WPR_KEY2 0x53

/* RTC time stamp time register */
#define RTC_TSTR 0x30
/* RTC time stamp date register */
#define RTC_TSDR 0x34
/* RTC tamper and alternate function configuration register */
#define RTC_TAFCR 0x40
/* RTC backup registers */
#define RTC_BKP0R 0x50
#define RTC_BKP1R 0x54
#define RTC_BKP2R 0x58
#define RTC_BKP19R 0x9c


